04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleVoF/DTCHullProp/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Mesh
./Allmesh

# Copy the fields into the processor directories
runApplication -a decomposePar -fields -copyZero

# Run
runParallel foamRun

# Reconstruct
runApplication reconstructPar

#------------------------------------------------------------------------------
